piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_adcui.h
/**
 *******************************************************************************
 * @file    MDR32F2xQI_adcui.h
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    24/05/2023
 * @brief   This file contains all the functions prototypes for the ADCUI
 *          firmware library.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MDR32F2xQI_ADCUI_H
#define MDR32F2xQI_ADCUI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2xQI_config.h"

/** @addtogroup __MDR32F2xQI_StdPeriph_Driver MDR32F2xQI Standard Peripherial Driver
 * @{
 */

/** @addtogroup ADCUI ADCUI
 * @{
 */

/** @defgroup ADCUI_Exported_Types ADCUI Exported Types
 * @{
 */

/**
 * @brief ADCUI Channels definition.
 */
typedef enum {
    ADCUI_CH_F0_I0 = ADCUI_CTRL1_I0EN,
    ADCUI_CH_F0_V0 = ADCUI_CTRL1_V0EN,
#if defined(USE_MDR32F21QI)
    ADCUI_CH_F1_I1 = ADCUI_CTRL1_I1EN,
    ADCUI_CH_F1_V1 = ADCUI_CTRL1_V1EN,
    ADCUI_CH_F2_I2 = ADCUI_CTRL1_I2EN,
    ADCUI_CH_F2_V2 = ADCUI_CTRL1_V2EN,
#endif
    ADCUI_CH_F0_I3 = ((uint32_t)0x40)
} ADCUI_Channel_TypeDef;

#if defined(USE_MDR32F21QI)

#define IS_ADCUI_CHANNEL(CH) (((CH) == ADCUI_CH_F0_I0) || ((CH) == ADCUI_CH_F0_V0) || \
                              ((CH) == ADCUI_CH_F1_I1) || ((CH) == ADCUI_CH_F1_V1) || \
                              ((CH) == ADCUI_CH_F2_I2) || ((CH) == ADCUI_CH_F2_V2) || \
                              ((CH) == ADCUI_CH_F0_I3))

#elif defined(USE_MDR32F23QI)

#define IS_ADCUI_CHANNEL(CH) (((CH) == ADCUI_CH_F0_I0) || ((CH) == ADCUI_CH_F0_V0) || \
                              ((CH) == ADCUI_CH_F0_I3))

#endif

#define IS_ADCUI_CHANNELS(CHS) (((CHS) <= 0x7F) && ((CHS) >= 0x1))

/**
 * @brief ADCUI Status flags.
 */
typedef enum {
#if defined(USE_MDR32F21QI)

    ADCUI_Fx_VF_EMP   = ADCUI_FxSTAT_FxVF_EMP,
    ADCUI_Fx_VF_FLL   = ADCUI_FxSTAT_FxVF_FLL,
    ADCUI_Fx_VF_OVR   = ADCUI_FxSTAT_FxVF_OVR,
    ADCUI_Fx_IF_EMP   = ADCUI_FxSTAT_FxIF_EMP,
    ADCUI_Fx_IF_FLL   = ADCUI_FxSTAT_FxIF_FLL,
    ADCUI_Fx_IF_OVR   = ADCUI_FxSTAT_FxIF_OVR,
    ADCUI_Fx_SAGF     = ADCUI_FxSTAT_FxSAGF,
    ADCUI_Fx_PEAKVF   = ADCUI_FxSTAT_FxPEAKVF,
    ADCUI_Fx_PEAKIF   = ADCUI_FxSTAT_FxPEAKIF,
    ADCUI_Fx_WATTOVP  = ADCUI_FxSTAT_FxWATTOVP,
    ADCUI_Fx_VAROVP   = ADCUI_FxSTAT_FxVAROVP,
    ADCUI_Fx_VAOV     = ADCUI_FxSTAT_FxVAOV,
    ADCUI_Fx_ZXTOF    = ADCUI_FxSTAT_FxZXTOF,
    ADCUI_Fx_ICHANNEL = ADCUI_FxSTAT_FxICHANNEL,
    ADCUI_Fx_FAULTCON = ADCUI_FxSTAT_FxFAULTCON,
    ADCUI_Fx_APSIGN   = ADCUI_FxSTAT_FxAPSIGN,
    ADCUI_Fx_APNLDFL  = ADCUI_FxSTAT_FxAPNLDFL,
    ADCUI_Fx_VARSIGN  = ADCUI_FxSTAT_FxVARSIGN,
    ADCUI_Fx_VARNLDFL = ADCUI_FxSTAT_FxVARNLDFL,
    ADCUI_Fx_VANLDFL  = ADCUI_FxSTAT_FxVANLDFL,
    ADCUI_Fx_ZEROCRS  = ADCUI_FxSTAT_FxZEROCRS,
    ADCUI_Fx_C3IF_EMP = ADCUI_FxSTAT_C3IF_EMP,
    ADCUI_Fx_C3IF_FLL = ADCUI_FxSTAT_C3IF_FLL,
    ADCUI_Fx_C3IF_OVR = ADCUI_FxSTAT_C3IF_OVR,
    ADCUI_Fx_WATTOVN  = ADCUI_FxSTAT_FxWATTOVN,
    ADCUI_Fx_VAROVN   = ADCUI_FxSTAT_FxVAROVN

#elif defined(USE_MDR32F23QI)

    ADCUI_Fx_VF_EMP   = ADCUI_F0STAT_F0VF_EMP,
    ADCUI_Fx_VF_FLL   = ADCUI_F0STAT_F0VF_FLL,
    ADCUI_Fx_VF_OVR   = ADCUI_F0STAT_F0VF_OVR,
    ADCUI_Fx_IF_EMP   = ADCUI_F0STAT_F0IF_EMP,
    ADCUI_Fx_IF_FLL   = ADCUI_F0STAT_F0IF_FLL,
    ADCUI_Fx_IF_OVR   = ADCUI_F0STAT_F0IF_OVR,
    ADCUI_Fx_SAGF     = ADCUI_F0STAT_F0SAGF,
    ADCUI_Fx_PEAKVF   = ADCUI_F0STAT_F0PEAKVF,
    ADCUI_Fx_PEAKIF   = ADCUI_F0STAT_F0PEAKIF,
    ADCUI_Fx_WATTOVP  = ADCUI_F0STAT_F0WATTOVP,
    ADCUI_Fx_VAROVP   = ADCUI_F0STAT_F0VAROVP,
    ADCUI_Fx_VAOV     = ADCUI_F0STAT_F0VAOV,
    ADCUI_Fx_ZXTOF    = ADCUI_F0STAT_F0ZXTOF,
    ADCUI_Fx_ICHANNEL = ADCUI_F0STAT_F0ICHANNEL,
    ADCUI_Fx_FAULTCON = ADCUI_F0STAT_F0FAULTCON,
    ADCUI_Fx_APSIGN   = ADCUI_F0STAT_F0APSIGN,
    ADCUI_Fx_APNLDFL  = ADCUI_F0STAT_F0APNLDFL,
    ADCUI_Fx_VARSIGN  = ADCUI_F0STAT_F0VARSIGN,
    ADCUI_Fx_VARNLDFL = ADCUI_F0STAT_F0VARNLDFL,
    ADCUI_Fx_VANLDFL  = ADCUI_F0STAT_F0VANLDFL,
    ADCUI_Fx_ZEROCRS  = ADCUI_F0STAT_F0ZEROCRS,
    ADCUI_Fx_C3IF_EMP = ADCUI_F0STAT_C3IF_EMP,
    ADCUI_Fx_C3IF_FLL = ADCUI_F0STAT_C3IF_FLL,
    ADCUI_Fx_C3IF_OVR = ADCUI_F0STAT_C3IF_OVR,
    ADCUI_Fx_WATTOVN  = ADCUI_F0STAT_F0WATTOVN,
    ADCUI_Fx_VAROVN   = ADCUI_F0STAT_F0VAROVN

#endif
} ADCUI_Flags_TypeDef;

#define ADCUI_FLAGS_MASK (ADCUI_Fx_VF_EMP |   \
                          ADCUI_Fx_VF_FLL |   \
                          ADCUI_Fx_VF_OVR |   \
                          ADCUI_Fx_IF_EMP |   \
                          ADCUI_Fx_IF_FLL |   \
                          ADCUI_Fx_IF_OVR |   \
                          ADCUI_Fx_SAGF |     \
                          ADCUI_Fx_PEAKVF |   \
                          ADCUI_Fx_PEAKIF |   \
                          ADCUI_Fx_WATTOVP |  \
                          ADCUI_Fx_VAROVP |   \
                          ADCUI_Fx_VAOV |     \
                          ADCUI_Fx_ZXTOF |    \
                          ADCUI_Fx_ICHANNEL | \
                          ADCUI_Fx_FAULTCON | \
                          ADCUI_Fx_APSIGN |   \
                          ADCUI_Fx_APNLDFL |  \
                          ADCUI_Fx_VARSIGN |  \
                          ADCUI_Fx_VARNLDFL | \
                          ADCUI_Fx_VANLDFL |  \
                          ADCUI_Fx_ZEROCRS |  \
                          ADCUI_Fx_C3IF_EMP | \
                          ADCUI_Fx_C3IF_FLL | \
                          ADCUI_Fx_C3IF_OVR | \
                          ADCUI_Fx_WATTOVN |  \
                          ADCUI_Fx_VAROVN)

#define IS_ADCUI_FLAG(FLAG) (((FLAG) == ADCUI_Fx_VF_EMP) || ((FLAG) == ADCUI_Fx_VF_FLL) ||     \
                             ((FLAG) == ADCUI_Fx_VF_OVR) || ((FLAG) == ADCUI_Fx_IF_EMP) ||     \
                             ((FLAG) == ADCUI_Fx_IF_FLL) || ((FLAG) == ADCUI_Fx_IF_OVR) ||     \
                             ((FLAG) == ADCUI_Fx_SAGF) || ((FLAG) == ADCUI_Fx_PEAKVF) ||       \
                             ((FLAG) == ADCUI_Fx_PEAKIF) || ((FLAG) == ADCUI_Fx_WATTOVP) ||    \
                             ((FLAG) == ADCUI_Fx_VAROVP) || ((FLAG) == ADCUI_Fx_VAOV) ||       \
                             ((FLAG) == ADCUI_Fx_ZXTOF) || ((FLAG) == ADCUI_Fx_ICHANNEL) ||    \
                             ((FLAG) == ADCUI_Fx_FAULTCON) || ((FLAG) == ADCUI_Fx_APSIGN) ||   \
                             ((FLAG) == ADCUI_Fx_APNLDFL) || ((FLAG) == ADCUI_Fx_VARSIGN) ||   \
                             ((FLAG) == ADCUI_Fx_VARNLDFL) || ((FLAG) == ADCUI_Fx_VANLDFL) ||  \
                             ((FLAG) == ADCUI_Fx_ZEROCRS) || ((FLAG) == ADCUI_Fx_C3IF_EMP) ||  \
                             ((FLAG) == ADCUI_Fx_C3IF_FLL) || ((FLAG) == ADCUI_Fx_C3IF_OVR) || \
                             ((FLAG) == ADCUI_Fx_WATTOVN || ((FLAG) == ADCUI_Fx_VAROVN)))

/**
 * @brief ADCUI Data output resolution (RESOL).
 */
typedef enum {
    ADCUI_DATA_RESOL_16BIT = (((uint32_t)0x0) << ADCUI_CTRL1_RESOL_Pos),
    ADCUI_DATA_RESOL_24BIT = (((uint32_t)0x1) << ADCUI_CTRL1_RESOL_Pos)
} ADCUI_DataResol_TypeDef;

