piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_adcui.h
#define IS_ADCUI_DATA_RESOL(RESOL) (((RESOL) == ADCUI_DATA_RESOL_16BIT) || \
                                    ((RESOL) == ADCUI_DATA_RESOL_24BIT))

/**
 * @brief ADCUI Zero-cross low pass filter (ZXLPF).
 */
typedef enum {
    ADCUI_ZXLPF_FILTER_ENABLE  = (((uint32_t)0x0) << ADCUI_CTRL1_ZXLPF_Pos),
    ADCUI_ZXLPF_FILTER_DISABLE = (((uint32_t)0x1) << ADCUI_CTRL1_ZXLPF_Pos)
} ADCUI_ZeroCrossLowPassFilter_TypeDef;

#define IS_ZXLPF_FILTER(STATE) (((STATE) == ADCUI_ZXLPF_FILTER_ENABLE) || \
                                ((STATE) == ADCUI_ZXLPF_FILTER_DISABLE))

/**
 * @brief ADCUI Period lenght (PER_LENGTH).
 */
typedef enum {
    ADCUI_PER_LENGTH_1   = ADCUI_CTRL1_PER_LENGHT_1,
    ADCUI_PER_LENGTH_2   = ADCUI_CTRL1_PER_LENGHT_2,
    ADCUI_PER_LENGTH_4   = ADCUI_CTRL1_PER_LENGHT_4,
    ADCUI_PER_LENGTH_8   = ADCUI_CTRL1_PER_LENGHT_8,
    ADCUI_PER_LENGTH_16  = ADCUI_CTRL1_PER_LENGHT_16,
    ADCUI_PER_LENGTH_32  = ADCUI_CTRL1_PER_LENGHT_32,
    ADCUI_PER_LENGTH_64  = ADCUI_CTRL1_PER_LENGHT_64,
    ADCUI_PER_LENGTH_128 = ADCUI_CTRL1_PER_LENGHT_128
} ADCUI_PeriodLength_TypeDef;

#define IS_ADCUI_PER_LENGTH(LENGTH) (((LENGTH) == ADCUI_PER_LENGTH_1) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_2) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_4) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_8) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_16) || \
                                     ((LENGTH) == ADCUI_PER_LENGTH_32) || \
                                     ((LENGTH) == ADCUI_PER_LENGTH_64) || \
                                     ((LENGTH) == ADCUI_PER_LENGTH_128))

/**
 * @brief ADCUI "No load" active power calculation mode (APNOLOAD).
 */
typedef enum {
    ADCUI_APNOLOAD_FULL       = ADCUI_CTRL1_APNOLOAD_FULL,
    ADCUI_APNOLOAD_0p012pct   = ADCUI_CTRL1_APNOLOAD_0p012pct,
    ADCUI_APNOLOAD_0p0061pct  = ADCUI_CTRL1_APNOLOAD_0p0061pct,
    ADCUI_APNOLOAD_0p00305pct = ADCUI_CTRL1_APNOLOAD_0p00305pct
} ADCUI_ActivePowerNoLoad_TypeDef;

#define IS_ADCUI_APNOLOAD(LOAD) (((LOAD) == ADCUI_APNOLOAD_FULL) ||      \
                                 ((LOAD) == ADCUI_APNOLOAD_0p012pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0061pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00305pct))
/**
 * @brief ADCUI "No load" reactive power calculation mode (VARNOLOAD).
 */
typedef enum {
    ADCUI_VARNOLOAD_FULL       = ADCUI_CTRL1_VARNOLOAD_FULL,
    ADCUI_VARNOLOAD_0p012pct   = ADCUI_CTRL1_VARNOLOAD_0p012pct,
    ADCUI_VARNOLOAD_0p0061pct  = ADCUI_CTRL1_VARNOLOAD_0p0061pct,
    ADCUI_VARNOLOAD_0p00305pct = ADCUI_CTRL1_VARNOLOAD_0p00305pct
} ADCUI_ReactivePowerNoLoad_TypeDef;

#define IS_ADCUI_VARNOLOAD(LOAD) (((LOAD) == ADCUI_VARNOLOAD_FULL) ||      \
                                  ((LOAD) == ADCUI_VARNOLOAD_0p012pct) ||  \
                                  ((LOAD) == ADCUI_VARNOLOAD_0p0061pct) || \
                                  ((LOAD) == ADCUI_VARNOLOAD_0p00305pct))
/**
 * @brief ADCUI "No load" full power calculation mode (VANOLOAD).
 */
typedef enum {
    ADCUI_VANOLOAD_FULL       = ADCUI_CTRL1_VANOLOAD_FULL,
    ADCUI_VANOLOAD_0p012pct   = ADCUI_CTRL1_VANOLOAD_0p012pct,
    ADCUI_VANOLOAD_0p0061pct  = ADCUI_CTRL1_VANOLOAD_0p0061pct,
    ADCUI_VANOLOAD_0p00305pct = ADCUI_CTRL1_VANOLOAD_0p00305pct
} ADCUI_FullPowerNoLoad_TypeDef;

#define IS_ADCUI_VANOLOAD(LOAD) (((LOAD) == ADCUI_VANOLOAD_FULL) ||      \
                                 ((LOAD) == ADCUI_VANOLOAD_0p012pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0061pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00305pct))

/**
 * @brief ADCUI Reference voltage configuration (VREF_SEL).
 */
typedef enum {
    ADCUI_REFERENCE_VOLTAGE_INTERNAL = !ADCUI_CTRL1_VREF_SEL,
    ADCUI_REFERENCE_VOLTAGE_EXTERNAL = ADCUI_CTRL1_VREF_SEL
} ADCUI_VRefConfig_TypeDef;

#define IS_ADCUI_REFERENCE_VOLTAGE(RV) (((RV) == ADCUI_REFERENCE_VOLTAGE_INTERNAL) || \
                                        ((RV) == ADCUI_REFERENCE_VOLTAGE_EXTERNAL))

/**
 * @brief ADCUI Reference voltage buffering configuration (BUF_BYP).
 */
typedef enum {
    ADCUI_USE_VREF_BUF     = (((uint32_t)0x0) << ADCUI_CTRL1_VREF_SEL_Pos),
    ADCUI_NOT_USE_VREF_BUF = (((uint32_t)0x1) << ADCUI_CTRL1_VREF_SEL_Pos)
} ADCUI_VRefBufUse_TypeDef;

#define IS_ADCUI_BUFFER_VREF_USE(USE) (((USE) == ADCUI_USE_VREF_BUF) || \
                                       ((USE) == ADCUI_NOT_USE_VREF_BUF))

/**
 * @brief ADCUI Chopper frequency divider (CHOP_FREQ).
 */
#if defined(USE_MDR32F21QI)

typedef enum {
    ADCUI_CHOPPER_FREQUENCY_DIV_2  = ADCUI_CTRL1_CHOP_FREQ_DIV_2,
    ADCUI_CHOPPER_FREQUENCY_DIV_4  = ADCUI_CTRL1_CHOP_FREQ_DIV_4,
    ADCUI_CHOPPER_FREQUENCY_DIV_8  = ADCUI_CTRL1_CHOP_FREQ_DIV_8,
    ADCUI_CHOPPER_FREQUENCY_DIV_16 = ADCUI_CTRL1_CHOP_FREQ_DIV_16
} ADCUI_ChopperFreqPrescaler_TypeDef;

#define IS_ADCUI_CHOPPER_FREQUENCY_PRESCALER(FD) (((FD) & (~ADCUI_CTRL1_CHOP_FREQ_Msk)) == 0)

#endif

/**
 * @brief ADCUI Zero-cross update RMS value (ZXRMS).
 */
typedef enum {
    ADCUI_REG_CONTINUOUS_UPDATE = (((uint32_t)0x0) << ADCUI_CTRL1_ZXRMS_Pos),
    ADCUI_REG_UPDATE_BY_ZERO    = (((uint32_t)0x1) << ADCUI_CTRL1_ZXRMS_Pos)
} ADCUI_ZeroCrossUpdateRMS_TypeDef;

#define IS_ADCUI_ZXRMS_REG_UPDATE(UPDATE) (((UPDATE) == ADCUI_REG_CONTINUOUS_UPDATE) || \
                                           ((UPDATE) == ADCUI_REG_UPDATE_BY_ZERO))
/**
 * @brief ADCUI Oversampling divider (OSR_CONF).
 */
typedef enum {
    ADCUI_OVERSAMPLING_DIV_256 = (uint32_t)(0x00),
    ADCUI_OVERSAMPLING_DIV_128 = (uint32_t)(0x01),
    ADCUI_OVERSAMPLING_DIV_64  = (uint32_t)(0x02)
} ADCUI_Divider_TypeDef;

#define IS_ADCUI_OSR_COF(COF) (((COF) == ADCUI_OVERSAMPLING_DIV_256) || \
                               ((COF) == ADCUI_OVERSAMPLING_DIV_128) || \
                               ((COF) == ADCUI_OVERSAMPLING_DIV_64))

/**
 * @brief @brief ADCUI Fx integrator state in I channel (FxINTEN).
 */
typedef enum {
    ADCUI_INT_ENABLE  = (uint32_t)(0x00),
    ADCUI_INT_DISABLE = (uint32_t)(0x01)
} ADCUI_IntegratorState_TypeDef;

#define IS_ADCUI_INT_STATE(STATE) (((STATE) == ADCUI_INT_ENABLE) || \
                                   ((STATE) == ADCUI_INT_DISABLE))

/**
 * @brief ADCUI Source selection to store in full energy register VADATA (FxVASEL)
 */
typedef enum {
#if defined(USE_MDR32F21QI)

    ADCUI_FULL_ENERGY = (((uint32_t)0x0) << ADCUI_FxCTR_FxVASEL_Pos),
    ADCUI_RMS_CURRENT = (((uint32_t)0x1) << ADCUI_FxCTR_FxVASEL_Pos)

#elif defined(USE_MDR32F23QI)

    ADCUI_FULL_ENERGY = (((uint32_t)0x0) << ADCUI_F0CTR_F0VASEL_Pos),
    ADCUI_RMS_CURRENT = (((uint32_t)0x1) << ADCUI_F0CTR_F0VASEL_Pos)

#endif
} ADCUI_SourceRegFullPower_TypeDef;

#define IS_ADCUI_VASEL(VASEL) (((VASEL) == ADCUI_FULL_ENERGY) || \
                               ((VASEL) == ADCUI_RMS_CURRENT))

/**
 * @brief ADCUI Fx gain in I/U channel (FxVGAIN, FxIGAIN).
 */
typedef enum {
    ADCUI_GAIN_0dB  = (uint32_t)(0x00),
    ADCUI_GAIN_6dB  = (uint32_t)(0x01),
    ADCUI_GAIN_12dB = (uint32_t)(0x02),
    ADCUI_GAIN_18dB = (uint32_t)(0x03)
} ADCUI_Gain_TypeDef;

