piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_adcui.h
#define IS_ADCUI_GAIN(GAIN) (((GAIN) == ADCUI_GAIN_0dB) ||  \
                             ((GAIN) == ADCUI_GAIN_6dB) ||  \
                             ((GAIN) == ADCUI_GAIN_12dB) || \
                             ((GAIN) == ADCUI_GAIN_18dB))

/**
 * @brief ADCUI Fx unit number.
 */
typedef enum {
    ADCUI_F0_UNIT = (uint32_t)(0x00),
#if defined(USE_MDR32F21QI)
    ADCUI_F1_UNIT = (uint32_t)(0x01),
    ADCUI_F2_UNIT = (uint32_t)(0x02)
#endif
} ADCUI_Unit_TypeDef;

#if defined(USE_MDR32F21QI)

#define IS_ADCUI_UNIT(UNIT) (((UNIT) == ADCUI_F0_UNIT) || \
                             ((UNIT) == ADCUI_F1_UNIT) || \
                             ((UNIT) == ADCUI_F2_UNIT))

#elif defined(USE_MDR32F23QI)

#define IS_ADCUI_UNIT(UNIT) ((UNIT) == ADCUI_F0_UNIT)

#endif
/**
 * @brief ADCUI Select signal source for ADCUI_FxVDAT (FxVSEL).
 */
typedef enum {
#if defined(USE_MDR32F21QI)

    ADCUI_Fx_U_VDAT              = ADCUI_FxMD0_FxVSEL_V,
    ADCUI_Fx_ACTIVE_POWER_VDAT   = ADCUI_FxMD0_FxVSEL_ACTIVEPOWER,
    ADCUI_Fx_REACTIVE_POWER_VDAT = ADCUI_FxMD0_FxVSEL_REACTIVEPOWER,
    ADCUI_Fx_FULL_POWER_VDAT     = ADCUI_FxMD0_FxVSEL_FULLPOWER

#elif defined(USE_MDR32F23QI)

    ADCUI_Fx_U_VDAT              = ADCUI_F0MD0_F0VSEL_V,
    ADCUI_Fx_ACTIVE_POWER_VDAT   = ADCUI_F0MD0_F0VSEL_ACTIVEPOWER,
    ADCUI_Fx_REACTIVE_POWER_VDAT = ADCUI_F0MD0_F0VSEL_REACTIVEPOWER,
    ADCUI_Fx_FULL_POWER_VDAT     = ADCUI_F0MD0_F0VSEL_FULLPOWER

#endif
} ADCUI_Fx_SourceVDAT_TypeDef;

#define IS_ADCUI_VDAT_SOURCE(SOURCE) (((SOURCE) == ADCUI_Fx_U_VDAT) ||              \
                                      ((SOURCE) == ADCUI_Fx_ACTIVE_POWER_VDAT) ||   \
                                      ((SOURCE) == ADCUI_Fx_REACTIVE_POWER_VDAT) || \
                                      ((SOURCE) == ADCUI_Fx_FULL_POWER_VDAT))

/**
 * @brief ADCUI Select signal source for ADCUI_FxIDAT (FxISEL).
 */
typedef enum {
#if defined(USE_MDR32F21QI)

    ADCUI_Fx_I_IDAT              = ADCUI_FxMD0_FxISEL_I,
    ADCUI_Fx_ACTIVE_POWER_IDAT   = ADCUI_FxMD0_FxISEL_ACTIVEPOWER,
    ADCUI_Fx_REACTIVE_POWER_IDAT = ADCUI_FxMD0_FxISEL_REACTIVEPOWER,
    ADCUI_Fx_FULL_POWER_IDAT     = ADCUI_FxMD0_FxISEL_FULLPOWER

#elif defined(USE_MDR32F23QI)

    ADCUI_Fx_I_IDAT              = ADCUI_F0MD0_F0ISEL_I,
    ADCUI_Fx_ACTIVE_POWER_IDAT   = ADCUI_F0MD0_F0ISEL_ACTIVEPOWER,
    ADCUI_Fx_REACTIVE_POWER_IDAT = ADCUI_F0MD0_F0ISEL_REACTIVEPOWER,
    ADCUI_Fx_FULL_POWER_IDAT     = ADCUI_F0MD0_F0ISEL_FULLPOWER

#endif
} ADCUI_Fx_SourceIDAT_TypeDef;

#define IS_ADCUI_IDAT_SOURCE(SOURCE) (((SOURCE) == ADCUI_Fx_I_IDAT) ||              \
                                      ((SOURCE) == ADCUI_Fx_ACTIVE_POWER_IDAT) ||   \
                                      ((SOURCE) == ADCUI_Fx_REACTIVE_POWER_IDAT) || \
                                      ((SOURCE) == ADCUI_Fx_FULL_POWER_IDAT))

/**
 * @brief Conversion value to ADCUI_F0I3DAT register before or after filter (F0I3SEL).
 */
typedef enum {
#if defined(USE_MDR32F21QI)

    ADCUI_F0I3SEL_AFTER_FILTER  = (((uint32_t)0x0) << ADCUI_FxMD0_FxI3SEL_Pos),
    ADCUI_F0I3SEL_BEFORE_FILTER = (((uint32_t)0x1) << ADCUI_FxMD0_FxI3SEL_Pos)

#elif defined(USE_MDR32F23QI)

    ADCUI_F0I3SEL_AFTER_FILTER  = (((uint32_t)0x0) << ADCUI_F0MD0_F0I3SEL_Pos),
    ADCUI_F0I3SEL_BEFORE_FILTER = (((uint32_t)0x1) << ADCUI_F0MD0_F0I3SEL_Pos)

#endif
} ADCUI_F0_I3SelectDataFilter_TypeDef;

#define IS_ADCUI_F0I3SEL_SELECT(SELECT) (((SELECT) == ADCUI_F0I3SEL_AFTER_FILTER) || \
                                         ((SELECT) == ADCUI_F0I3SEL_BEFORE_FILTER))

/**
 * @brief Active current channel in block F0 (F0SEL_I_CH).
 */
typedef enum {
    ADCUI_F0_I_CH_AUTO = (uint32_t)(0x00),
    ADCUI_F0_I_CH_I0   = (uint32_t)(0x01),
    ADCUI_F0_I_CH_I3   = (uint32_t)(0x02)
} ADCUI_F0_IChannelSelect_TypeDef;

#define IS_ADCUI_CHANNELI_SELECT(SELECT) (((SELECT) == ADCUI_F0_I_CH_AUTO) || \
                                          ((SELECT) == ADCUI_F0_I_CH_I0) ||   \
                                          ((SELECT) == ADCUI_F0_I_CH_I3))

/**
 * @brief ADCUI Interrupt definition.
 */
typedef enum {
#if defined(USE_MDR32F21QI)

    ADCUI_Fx_IT_VF_EMP   = ADCUI_FxSTAT_FxVF_EMP,
    ADCUI_Fx_IT_VF_FLL   = ADCUI_FxSTAT_FxVF_FLL,
    ADCUI_Fx_IT_VF_OVR   = ADCUI_FxSTAT_FxVF_OVR,
    ADCUI_Fx_IT_IF_EMP   = ADCUI_FxSTAT_FxIF_EMP,
    ADCUI_Fx_IT_IF_FLL   = ADCUI_FxSTAT_FxIF_FLL,
    ADCUI_Fx_IT_IF_OVR   = ADCUI_FxSTAT_FxIF_OVR,
    ADCUI_Fx_IT_SAGF     = ADCUI_FxSTAT_FxSAGF,
    ADCUI_Fx_IT_PEAKVF   = ADCUI_FxSTAT_FxPEAKVF,
    ADCUI_Fx_IT_PEAKIF   = ADCUI_FxSTAT_FxPEAKIF,
    ADCUI_Fx_IT_WATTOVP  = ADCUI_FxSTAT_FxWATTOVP,
    ADCUI_Fx_IT_VAROVP   = ADCUI_FxSTAT_FxVAROVP,
    ADCUI_Fx_IT_VAOV     = ADCUI_FxSTAT_FxVAOV,
    ADCUI_Fx_IT_ZXTOF    = ADCUI_FxSTAT_FxZXTOF,
    ADCUI_Fx_IT_FAULTCON = ADCUI_FxSTAT_FxFAULTCON,
    ADCUI_Fx_IT_APSIGN   = ADCUI_FxSTAT_FxAPSIGN,
    ADCUI_Fx_IT_APNLDFL  = ADCUI_FxSTAT_FxAPNLDFL,
    ADCUI_Fx_IT_VARSIGN  = ADCUI_FxSTAT_FxVARSIGN,
    ADCUI_Fx_IT_VARNLDFL = ADCUI_FxSTAT_FxVARNLDFL,
    ADCUI_Fx_IT_VANLDFL  = ADCUI_FxSTAT_FxVANLDFL,
    ADCUI_Fx_IT_ZEROCRS  = ADCUI_FxSTAT_FxZEROCRS,
    ADCUI_Fx_IT_C3IF_EMP = ADCUI_FxSTAT_C3IF_EMP,
    ADCUI_Fx_IT_C3IF_FLL = ADCUI_FxSTAT_C3IF_FLL,
    ADCUI_Fx_IT_C3IF_OVR = ADCUI_FxSTAT_C3IF_OVR,
    ADCUI_Fx_IT_WATTOVN  = ADCUI_FxSTAT_FxWATTOVN,
    ADCUI_Fx_IT_VAROVN   = ADCUI_FxSTAT_FxVAROVN

#elif defined(USE_MDR32F23QI)

    ADCUI_Fx_IT_VF_EMP   = ADCUI_F0STAT_F0VF_EMP,
    ADCUI_Fx_IT_VF_FLL   = ADCUI_F0STAT_F0VF_FLL,
    ADCUI_Fx_IT_VF_OVR   = ADCUI_F0STAT_F0VF_OVR,
    ADCUI_Fx_IT_IF_EMP   = ADCUI_F0STAT_F0IF_EMP,
    ADCUI_Fx_IT_IF_FLL   = ADCUI_F0STAT_F0IF_FLL,
    ADCUI_Fx_IT_IF_OVR   = ADCUI_F0STAT_F0IF_OVR,
    ADCUI_Fx_IT_SAGF     = ADCUI_F0STAT_F0SAGF,
    ADCUI_Fx_IT_PEAKVF   = ADCUI_F0STAT_F0PEAKVF,
    ADCUI_Fx_IT_PEAKIF   = ADCUI_F0STAT_F0PEAKIF,
    ADCUI_Fx_IT_WATTOVP  = ADCUI_F0STAT_F0WATTOVP,
    ADCUI_Fx_IT_VAROVP   = ADCUI_F0STAT_F0VAROVP,
    ADCUI_Fx_IT_VAOV     = ADCUI_F0STAT_F0VAOV,
    ADCUI_Fx_IT_ZXTOF    = ADCUI_F0STAT_F0ZXTOF,
    ADCUI_Fx_IT_FAULTCON = ADCUI_F0STAT_F0FAULTCON,
    ADCUI_Fx_IT_APSIGN   = ADCUI_F0STAT_F0APSIGN,
    ADCUI_Fx_IT_APNLDFL  = ADCUI_F0STAT_F0APNLDFL,
    ADCUI_Fx_IT_VARSIGN  = ADCUI_F0STAT_F0VARSIGN,
    ADCUI_Fx_IT_VARNLDFL = ADCUI_F0STAT_F0VARNLDFL,
    ADCUI_Fx_IT_VANLDFL  = ADCUI_F0STAT_F0VANLDFL,
    ADCUI_Fx_IT_ZEROCRS  = ADCUI_F0STAT_F0ZEROCRS,
    ADCUI_Fx_IT_C3IF_EMP = ADCUI_F0STAT_C3IF_EMP,
    ADCUI_Fx_IT_C3IF_FLL = ADCUI_F0STAT_C3IF_FLL,
    ADCUI_Fx_IT_C3IF_OVR = ADCUI_F0STAT_C3IF_OVR,
    ADCUI_Fx_IT_WATTOVN  = ADCUI_F0STAT_F0WATTOVN,
    ADCUI_Fx_IT_VAROVN   = ADCUI_F0STAT_F0VAROVN

#endif
} ADCUI_IT_TypeDef;

#define ADCUI_IT_MASK (ADCUI_Fx_IT_VF_EMP |   \
                       ADCUI_Fx_IT_VF_FLL |   \
                       ADCUI_Fx_IT_VF_OVR |   \
                       ADCUI_Fx_IT_IF_EMP |   \
                       ADCUI_Fx_IT_IF_FLL |   \
                       ADCUI_Fx_IT_IF_OVR |   \
                       ADCUI_Fx_IT_SAGF |     \
                       ADCUI_Fx_IT_PEAKVF |   \
                       ADCUI_Fx_IT_PEAKIF |   \
                       ADCUI_Fx_IT_WATTOVP |  \
                       ADCUI_Fx_IT_VAROVP |   \
                       ADCUI_Fx_IT_VAOV |     \
                       ADCUI_Fx_IT_ZXTOF |    \
                       ADCUI_Fx_IT_FAULTCON | \
                       ADCUI_Fx_IT_APSIGN |   \
                       ADCUI_Fx_IT_APNLDFL |  \
                       ADCUI_Fx_IT_VARSIGN |  \
                       ADCUI_Fx_IT_VARNLDFL | \
                       ADCUI_Fx_IT_VANLDFL |  \
                       ADCUI_Fx_IT_ZEROCRS |  \
                       ADCUI_Fx_IT_C3IF_EMP | \
                       ADCUI_Fx_IT_C3IF_FLL | \
                       ADCUI_Fx_IT_C3IF_OVR | \
                       ADCUI_Fx_IT_WATTOVN |  \
                       ADCUI_Fx_IT_VAROVN)

#define IS_ADCUI_ITS(IT)       (((IT) & (~ADCUI_IT_MASK)) == 0)

#define IS_ADCUI_CONFIG_IT(IT) (((IT) == ADCUI_Fx_IT_VF_EMP) || ((IT) == ADCUI_Fx_IT_VF_FLL) ||     \
                                ((IT) == ADCUI_Fx_IT_VF_OVR) || ((IT) == ADCUI_Fx_IT_IF_EMP) ||     \
                                ((IT) == ADCUI_Fx_IT_IF_FLL) || ((IT) == ADCUI_Fx_IT_IF_OVR) ||     \
                                ((IT) == ADCUI_Fx_IT_SAGF) || ((IT) == ADCUI_Fx_IT_PEAKVF) ||       \
                                ((IT) == ADCUI_Fx_IT_PEAKIF) || ((IT) == ADCUI_Fx_IT_WATTOVP) ||    \
                                ((IT) == ADCUI_Fx_IT_VAROVP) || ((IT) == ADCUI_Fx_IT_VAOV) ||       \
                                ((IT) == ADCUI_Fx_IT_ZXTOF) || ((IT) == ADCUI_Fx_IT_FAULTCON) ||    \
                                ((IT) == ADCUI_Fx_IT_APSIGN) || ((IT) == ADCUI_Fx_IT_APNLDFL) ||    \
                                ((IT) == ADCUI_Fx_IT_VARSIGN) || ((IT) == ADCUI_Fx_IT_VARNLDFL) ||  \
                                ((IT) == ADCUI_Fx_IT_VANLDFL) || ((IT) == ADCUI_Fx_IT_ZEROCRS) ||   \
                                ((IT) == ADCUI_Fx_IT_C3IF_EMP) || ((IT) == ADCUI_Fx_IT_C3IF_FLL) || \
                                ((IT) == ADCUI_Fx_IT_C3IF_OVR) || ((IT) == ADCUI_Fx_IT_WATTOVN) ||  \
                                ((IT) == ADCUI_Fx_IT_VAROVN))

/**
 * @brief ADCUI Init structure defintion
 */
typedef struct
{
    ADCUI_DataResol_TypeDef ADCUI_DataResol;                           /*!< Output data resolution.
                                                                            This parameter can be a value of @ref ADCUI_DataResol_TypeDef. */
    ADCUI_ZeroCrossLowPassFilter_TypeDef ADCUI_ZeroCrossLowPassFilter; /*!< The state of the ZXLPF filter.
                                                                            This parameter can be a value of @ref ADCUI_ZeroCrossLowPassFilter_TypeDef. */
    ADCUI_PeriodLength_TypeDef ADCUI_PeriodLength;                     /*!< Period and phase shift calculation range.
                                                                            This parameter can be a value of @ref ADCUI_PeriodLength_TypeDef. */
    ADCUI_ActivePowerNoLoad_TypeDef ADCUI_ActivePowerNoLoad;           /*!< No-load mode for active energy calculation.
                                                                            This parameter can be a value of @ref ADCUI_ActivePowerNoLoad_TypeDef. */
    ADCUI_ReactivePowerNoLoad_TypeDef ADCUI_ReactivePowerNoLoad;       /*!< No-load mode for reactive energy calculation.
                                                                            This parameter can be a value of @ref ADCUI_ReactivePowerNoLoad_TypeDef. */
    ADCUI_FullPowerNoLoad_TypeDef ADCUI_FullPowerNoLoad;               /*!< No load mode when calculating apparent energy.
                                                                            This parameter can be a value of @ref ADCUI_FullPowerNoLoad_TypeDef. */
    FunctionalState ADCUI_FreqVEnable;                                 /*!< Permission to calculate period duration in voltage channels.
                                                                            This parameter can be a value of @ref FunctionalState. */
    ADCUI_VRefConfig_TypeDef ADCUI_VRefConfig;                         /*!< Selecting the reference voltage for the ADC.
                                                                            This parameter can be a value of @ref ADCUI_VRefConfig_TypeDef. */
    ADCUI_VRefBufUse_TypeDef ADCUI_VRefBufUse;                         /*!< Reference voltage buffering.
                                                                            This parameter can be a value of @ref ADCUI_VRefBufUse_TypeDef. */
#if defined(USE_MDR32F21QI)
    FunctionalState ADCUI_ChopEnable;                                  /*!< The state of the chopper ADC I3  channel.
                                                                            This parameter can be a value of @ref FunctionalState. */
    ADCUI_ChopperFreqPrescaler_TypeDef ADCUI_ChopperFreqPrescaler;     /*!< Chopper frequency.
                                                                            This parameter can be a value of @ref ADCUI_ChopperFreqPrescaler_TypeDef. */
#endif
    ADCUI_ZeroCrossUpdateRMS_TypeDef ADCUI_ZeroCrossUpdateRMS;         /*!< RMS Register Update Controls.
                                                                            This parameter can be a value of @ref ADCUI_ZeroCrossUpdateRMS_TypeDef. */
    FunctionalState ADCUI_IBoostEnable;                                /*!< ADC current increase.
                                                                            This parameter can be a value of @ref FunctionalState. */
    ADCUI_Divider_TypeDef ADCUI_Divider;                               /*!< Selecting the oversampling factor.
                                                                            This parameter can be a value of @ref ADCUI_Divider_TypeDef. */
    uint16_t ADCUI_VoltageDropLevel;                                   /*!< Allowed voltage drop level.
                                                                            This parameter is an even number from 0 to 65536. */
    uint8_t ADCUI_VoltageHalfCyclesDrop;                               /*!< The number of half-cycles of voltage to calculate the drawdown of the voltage level.
                                                                            This parameter is an even number from 0 to 255. */
    uint16_t ADCUI_ZeroCrossTimeOut;                                   /*!< The value of the time-out register that sets this value when the voltage signal crosses V0.
                                                                            This parameter is an even number from 0 to 4095. */
} ADCUI_InitTypeDef;

/**
 * @brief ADCUI Fx unit structure
 */
typedef struct
{
    ADCUI_IntegratorState_TypeDef ADCUI_Fx_IntegratorEnable;         /*!< The state of integrator in I channel.
                                                                          This parameter can be a value of @ref ADCUI_IntegratorState_TypeDef */
    ADCUI_IntegratorState_TypeDef ADCUI_F0_I3IntegratorEnable;       /*!< The state of integrator in I3 channel in F0 unit.
                                                                          This parameter can be a value of @ref ADCUI_IntegratorState_TypeDef */
    ADCUI_SourceRegFullPower_TypeDef ADCUI_SourceRegFullPower;       /*!< Enable or disable dma request when there is data in the FIFO.
                                                                          This parameter can be a value of @ref ADCUI_SourceRegFullPower_TypeDef */
    ADCUI_Gain_TypeDef ADCUI_Fx_IGain;                               /*!< Specifies the level of analog gain I.
                                                                          This parameter can be a value of @ref ADCUI_Gain_TypeDef */
    ADCUI_Gain_TypeDef ADCUI_Fx_VGain;                               /*!< Specifies the level of analog gain U.
                                                                          This parameter can be a value of @ref ADCUI_Gain_TypeDef */
    uint8_t ADCUI_Fx_PhaseShift;                                     /*!< Phase shift of the voltage channel relative to the current channel.
                                                                          This parameter is an even number from 0 to 255. */
    ADCUI_Gain_TypeDef ADCUI_F0_I3Gain;                              /*!< Specifies the level of analog gain I in F0 unit.
                                                                          This parameter can be a value of @ref ADCUI_Gain_TypeDef */
    uint16_t ADCUI_Fx_IRMSCalibration;                               /*!< Calibration of the rms current calculator.
                                                                          This parameter is an even number from 0 to 4095. */
    ADCUI_Fx_SourceVDAT_TypeDef ADCUI_Fx_SourceVDAT;                 /*!< Selecting a signal source for the ADCUI_FxVDAT register.
                                                                          This parameter can be a value of @ref ADCUI_Fx_SourceVDAT_TypeDef */
    ADCUI_Fx_SourceIDAT_TypeDef ADCUI_Fx_SourceIDAT;                 /*!< Selecting a signal source for the ADCUI_FxI0DAT register.
                                                                          This parameter can be a value of @ref ADCUI_Fx_SourceIDAT_TypeDef */
    FunctionalState ADCUI_Fx_6dBIGainEnable;                         /*!< Gain 6 dB in Ix channel.
                                                                          This parameter can be a value of @ref FunctionalState. */
    FunctionalState ADCUI_Fx_6dBVGainEnable;                         /*!< Gain 6 dB in U channel.
                                                                          This parameter can be a value of @ref FunctionalState. */
    FunctionalState ADCUI_F0_6dBI3GainEnable;                        /*!< Gain 6 dB in I3 channel, only for F0.
                                                                          This parameter can be a value of @ref FunctionalState. */
    ADCUI_F0_I3SelectDataFilter_TypeDef ADCUI_F0_I3SelectDataFilter; /*!< Selecting the signal source for the ADCUI_F0I3DAT register.
                                                                          This parameter can be a value of @ref ADCUI_F0_I3SelectDataFilter_TypeDef */
    ADCUI_F0_IChannelSelect_TypeDef ADCUI_F0_IChannelSelect;         /*!< Selecting the active current channel for calculating power characteristics.
                                                                          This parameter can be a value of @ref ADCUI_F0_IChannelSelect_TypeDef */
} ADCUI_FxUnit_InitTypeDef;

/** @} */ /* End of group ADCUI_Exported_Types */

